In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
df = pd.read_csv("utility.csv", encoding = "utf-8")

In [65]:
df.head()

                record_id  ...  fuel_cost_per_mmbtu
0   f1_fuel_1994_12_1_0_7  ...                1.121
1  f1_fuel_1994_12_1_0_10  ...                1.120
2   f1_fuel_1994_12_2_0_1  ...                1.650
3   f1_fuel_1994_12_2_0_7  ...                1.970
4  f1_fuel_1994_12_2_0_10  ...                2.570

[5 rows x 11 columns]

In [5]:
df["record_id"].unique()

array(['f1_fuel_1994_12_1_0_7', 'f1_fuel_1994_12_1_0_10',
       'f1_fuel_1994_12_2_0_1', ..., 'f1_fuel_2018_12_12_1_10',
       'f1_fuel_2018_12_12_1_13', 'f1_fuel_2018_12_12_1_14'], dtype=object)

In [11]:
df.tail()

                     record_id  ...  fuel_cost_per_mmbtu
29518  f1_fuel_2018_12_12_0_13  ...                 9.03
29519   f1_fuel_2018_12_12_1_1  ...                 6.95
29520  f1_fuel_2018_12_12_1_10  ...                 8.99
29521  f1_fuel_2018_12_12_1_13  ...                 1.11
29522  f1_fuel_2018_12_12_1_14  ...                11.68

[5 rows x 11 columns]

In [6]:
df.shape

(29523, 11)

In [7]:
df.columns

Index(['record_id', 'utility_id_ferc1', 'report_year', 'plant_name_ferc1',
       'fuel_type_code_pudl', 'fuel_unit', 'fuel_qty_burned',
       'fuel_mmbtu_per_unit', 'fuel_cost_per_unit_burned',
       'fuel_cost_per_unit_delivered', 'fuel_cost_per_mmbtu'],
      dtype='object')

## **Question 1**

In [23]:
A = [1,2,3,4,5,6]
B = [13, 21, 34]

#to add  B to A, we use extend method

In [25]:
A.extend(B)
A

[1, 2, 3, 4, 5, 6, 13, 21, 34, 13, 21, 34]

### **Question 2**

In [27]:
np.identity(3)

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

### **Question 3**

In [56]:
#The most widely methid to calculate the average is the mean.
#To approach the method, I will use group methid.

#Fuel cost with the lowest cost per umit sold will be represented by fcs
fsc  = pd.DataFrame(df.groupby('fuel_type_code_pudl')['fuel_cost_per_unit_burned'].mean()).sort_values(by="fuel_cost_per_unit_burned",ascending=False)
fsc

                     fuel_cost_per_unit_burned
fuel_type_code_pudl
nuclear                            4955.157002
oil                                 168.877086
coal                                 67.421830
waste                                19.518122
other                                18.253856
gas                                  13.659397

from the dataframe above, the lowest average fuel cost per unit burned is gas.

### Q**uestion 4**

In [29]:
#To get the statistics data
round(df.describe(), 2)

       utility_id_ferc1  ...  fuel_cost_per_mmbtu
count          29523.00  ...             29523.00
mean             118.60  ...                19.30
std               74.18  ...              2091.54
min                1.00  ...               -41.50
25%               55.00  ...                 1.94
50%              122.00  ...                 4.13
75%              176.00  ...                 7.74
max              514.00  ...            359278.00

[8 rows x 7 columns]

from the code above, the standard deviation and 75th percentile of the measure of energy per unit (Fuel_mmbtu_per_unit) in two decimal places are 10.60 and 17.01.

### **Question 5**

In [30]:
df.columns

Index(['record_id', 'utility_id_ferc1', 'report_year', 'plant_name_ferc1',
       'fuel_type_code_pudl', 'fuel_unit', 'fuel_qty_burned',
       'fuel_mmbtu_per_unit', 'fuel_cost_per_unit_burned',
       'fuel_cost_per_unit_delivered', 'fuel_cost_per_mmbtu'],
      dtype='object')

In [36]:
skewness = round(df["fuel_qty_burned"].skew(), 2)
skewness
f"The skewness of fuel quantity burned is {skewness}"

'The skewness of fuel quantity burned is 15.85'

In [40]:
kurtosis = round(df["fuel_qty_burned"].kurtosis(), 2)
kurtosis
f"The kurtosis of fuel quantity burned is {kurtosis}"

'The kurtosis of fuel quantity burned is 651.37'

### **Question 6**

In [42]:
df.isnull().any()

record_id                       False
utility_id_ferc1                False
report_year                     False
plant_name_ferc1                False
fuel_type_code_pudl             False
fuel_unit                        True
fuel_qty_burned                 False
fuel_mmbtu_per_unit             False
fuel_cost_per_unit_burned       False
fuel_cost_per_unit_delivered    False
fuel_cost_per_mmbtu             False
dtype: bool

From the code above, the feature that has mising values is Fuel Unit.

In [45]:
df["fuel_unit"].isnull().sum()

180

From the code above, the total mising values for Fuelunit is 180

In [48]:
percentage_missing = round(df["fuel_unit"].isnull().sum()/len(df) * 100, 2)
percentage_missing

0.61

In [50]:
f"The perecentage mising valies for fuel unit is {percentage_missing}"

'The perecentage mising valies for fuel unit is 0.61'

### **Question 7**

In [55]:
df[["fuel_unit"]].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29523 entries, 0 to 29522
Data columns (total 1 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   fuel_unit  29343 non-null  object
dtypes: object(1)
memory usage: 230.8+ KB

looking at the data, the fuel unit falls under Categorical data because it can be grouped to draw insights. The method to fill categoriacal dats is usning the mostfrequent items in the column which is the mode.

### **Question 8**

In [57]:
df.corr()

                              utility_id_ferc1  ...  fuel_cost_per_mmbtu
utility_id_ferc1                      1.000000  ...             0.006122
report_year                           0.093323  ...             0.010261
fuel_qty_burned                      -0.057447  ...            -0.001896
fuel_mmbtu_per_unit                  -0.066946  ...            -0.005884
fuel_cost_per_unit_burned            -0.037863  ...            -0.000437
fuel_cost_per_unit_delivered         -0.016414  ...            -0.000109
fuel_cost_per_mmbtu                   0.006122  ...             1.000000

[7 rows x 7 columns]

In [64]:
pd.DataFrame(df.corr()["fuel_cost_per_unit_burned"].sort_values(ascending=False))

                              fuel_cost_per_unit_burned
fuel_cost_per_unit_burned                      1.000000
report_year                                    0.013599
fuel_cost_per_unit_delivered                   0.011007
fuel_cost_per_mmbtu                           -0.000437
fuel_mmbtu_per_unit                           -0.010034
fuel_qty_burned                               -0.018535
utility_id_ferc1                              -0.037863

The features that  has the second and third lowest correlation with the Fuel Cost Per Unit Burned are fuel_qty_burned and fuel_mmbtu_per_unit respectively.

### **Question 9**

In [67]:
#filter the entry that all the year are 1998 and fuel type is coal by fuel cost
x = df.loc[(df["report_year"]==1998) & (df["fuel_type_code_pudl"]=="coal")]["fuel_cost_per_unit_burned"].sum()
x

11902.597

In [69]:
#filter the entry that all the year are 1994 and fuel type is coal by fuel cost
y = df.loc[(df["report_year"]==1994) & (df["fuel_type_code_pudl"]=="coal")]["fuel_cost_per_unit_burned"].sum()
y

14984.572000000002

In [74]:
percentage = round((y-x)/y * 100, 0)
percentage

21.0

In [77]:
f"The perecntage change in the fuel cost per unit burned in 1998 compared to 1994 is {percentage}%"

'The perecntage change in the fuel cost per unit burned in 1998 compared to 1994 is 21.0%'

QUESTION 10

In [86]:
# year with highest average fuel cost per unit_delivered
ypd = pd.DataFrame(df.groupby('report_year')['fuel_cost_per_unit_delivered'].mean().sort_values(ascending=False))

In [87]:
ypd

             fuel_cost_per_unit_delivered
report_year
1997                         11140.197239
1996                          9196.705948
2000                           985.362877
2009                           652.694163
2018                           499.269966
2015                           326.535511
1998                           287.154420
2014                           192.737183
2013                           172.307591
2004                           139.524275
2016                           103.901761
2010                            91.862105
1994                            63.636060
2012                            60.994502
2001                            60.050396
2011                            59.774667
2008                            58.588197
2003                            55.663493
2002                            47.594361
2017                            46.196861
2007                            43.325023
2005                            41.438184
2006                            38.657484
1995                            32.735269
1999                            25.551627

From the code above, the year with highest average fuel cost per unit_delivered is 1997.